; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-4-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p0-4 - location
	p1-2 - location
	p1-5 - location
	p1-7 - location
	p3-5 - location
	p3-6 - location
	p4-3 - location
	p5-0 - location
	p6-4 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s4)
	(at driver3 s3)
	(at driver4 s3)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at package1 s5)
	(at package2 s3)
	(at package3 s5)
	(at package4 s7)
	(at package5 s6)
	(at package6 s6)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 46)
	(= (time-to-walk p0-1 s0) 46)
	(= (time-to-walk s1 p0-1) 36)
	(= (time-to-walk p0-1 s1) 36)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 83)
	(= (time-to-walk p0-4 s0) 83)
	(= (time-to-walk s4 p0-4) 19)
	(= (time-to-walk p0-4 s4) 19)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 67)
	(= (time-to-walk p1-2 s1) 67)
	(= (time-to-walk s2 p1-2) 7)
	(= (time-to-walk p1-2 s2) 7)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 93)
	(= (time-to-walk p1-5 s1) 93)
	(= (time-to-walk s5 p1-5) 14)
	(= (time-to-walk p1-5 s5) 14)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(= (time-to-walk s1 p1-7) 53)
	(= (time-to-walk p1-7 s1) 53)
	(= (time-to-walk s7 p1-7) 31)
	(= (time-to-walk p1-7 s7) 31)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 64)
	(= (time-to-walk p3-5 s3) 64)
	(= (time-to-walk s5 p3-5) 73)
	(= (time-to-walk p3-5 s5) 73)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 13)
	(= (time-to-walk p3-6 s3) 13)
	(= (time-to-walk s6 p3-6) 30)
	(= (time-to-walk p3-6 s6) 30)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 88)
	(= (time-to-walk p4-3 s4) 88)
	(= (time-to-walk s3 p4-3) 47)
	(= (time-to-walk p4-3 s3) 47)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 72)
	(= (time-to-walk p5-0 s5) 72)
	(= (time-to-walk s0 p5-0) 23)
	(= (time-to-walk p5-0 s0) 23)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 55)
	(= (time-to-walk p6-4 s6) 55)
	(= (time-to-walk s4 p6-4) 36)
	(= (time-to-walk p6-4 s4) 36)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 63)
	(= (time-to-drive s6 s0) 63)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 4)
	(= (time-to-drive s0 s1) 4)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 31)
	(= (time-to-drive s2 s1) 31)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 64)
	(= (time-to-drive s5 s1) 64)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 11)
	(= (time-to-drive s7 s1) 11)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 9)
	(= (time-to-drive s3 s2) 9)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 12)
	(= (time-to-drive s6 s2) 12)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 64)
	(= (time-to-drive s0 s3) 64)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 89)
	(= (time-to-drive s1 s3) 89)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 99)
	(= (time-to-drive s4 s3) 99)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 78)
	(= (time-to-drive s6 s3) 78)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 35)
	(= (time-to-drive s7 s3) 35)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 35)
	(= (time-to-drive s0 s4) 35)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 61)
	(= (time-to-drive s1 s4) 61)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 53)
	(= (time-to-drive s0 s5) 53)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 1)
	(= (time-to-drive s2 s5) 1)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 67)
	(= (time-to-drive s1 s6) 67)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 45)
	(= (time-to-drive s4 s6) 45)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 15)
	(= (time-to-drive s4 s7) 15)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s4)
	(at driver4 s4)
	(at truck1 s5)
	(at truck2 s1)
	(at truck3 s3)
	(at truck4 s1)
	(at package1 s1)
	(at package2 s2)
	(at package3 s3)
	(at package4 s0)
	(at package5 s3)
	(at package6 s6)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 4  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver4 truck1 s3)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 3 of 13
2. (load-truck package2 truck1 s3)
   deleted: (at package2 s3)
   added: (in package2 truck1)
   goals met: 3 of 13
3. (drive-truck truck1 s3 s1 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (driven) from 0 to 89
   goals met: 3 of 13
4. (board-truck driver3 truck4 s3)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 3 of 13
5. (drive-truck truck4 s3 s7 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s7)
   changed: (driven) from 89 to 124
   goals met: 3 of 13
6. (load-truck package4 truck4 s7)
   deleted: (at package4 s7)
   added: (in package4 truck4)
   goals met: 3 of 13
7. (drive-truck truck4 s7 s1 driver3)
   deleted: (at truck4 s7)
   added: (at truck4 s1)
   changed: (driven) from 124 to 135
   goals met: 4 of 13
8. (drive-truck truck4 s1 s0 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (driven) from 135 to 139
   goals met: 3 of 13
9. (unload-truck package4 truck4 s0)
   deleted: (in package4 truck4)
   added: (at package4 s0)
   goals met: 4 of 13
10. (drive-truck truck1 s1 s2 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 139 to 170
   goals met: 4 of 13
11. (unload-truck package2 truck1 s2)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   goals met: 5 of 13
12. (disembark-truck driver3 truck4 s0)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 5 of 13
13. (board-truck driver1 truck4 s0)
   deleted: (at driver1 s0) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 5 of 13
14. (drive-truck truck4 s0 s6 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s6)
   changed: (driven) from 170 to 233
   goals met: 5 of 13
15. (load-truck package5 truck4 s6)
   deleted: (at package5 s6)
   added: (in package5 truck4)
   goals met: 5 of 13
16. (drive-truck truck4 s6 s3 driver1)
   deleted: (at truck4 s6)
   added: (at truck4 s3)
   changed: (driven) from 233 to 311
   goals met: 5 of 13
17. (unload-truck package5 truck4 s3)
   deleted: (in package5 truck4)
   added: (at package5 s3)
   goals met: 6 of 13
18. (drive-truck truck1 s2 s5 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (driven) from 311 to 312
   goals met: 7 of 13
19. (load-truck package1 truck1 s5)
   deleted: (at package1 s5)
   added: (in package1 truck1)
   goals met: 7 of 13
20. (drive-truck truck1 s5 s1 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (driven) from 312 to 376
   goals met: 6 of 13
21. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   goals met: 7 of 13
22. (disembark-truck driver1 truck4 s3)
   deleted: (driving driver1 truck4)
   added: (at driver1 s3) (empty truck4)
   goals met: 8 of 13
23. (drive-truck truck1 s1 s5 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (driven) from 376 to 440
   goals met: 9 of 13
24. (load-truck package3 truck1 s5)
   deleted: (at package3 s5)
   added: (in package3 truck1)
   goals met: 9 of 13
25. (drive-truck truck1 s5 s2 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   changed: (driven) from 440 to 441
   goals met: 8 of 13
26. (drive-truck truck1 s2 s3 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (driven) from 441 to 450
   goals met: 8 of 13
27. (unload-truck package3 truck1 s3)
   deleted: (in package3 truck1)
   added: (at package3 s3)
   goals met: 9 of 13
28. (drive-truck truck1 s3 s2 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (driven) from 450 to 459
   goals met: 9 of 13
29. (disembark-truck driver4 truck1 s2)
   deleted: (driving driver4 truck1)
   added: (at driver4 s2) (empty truck1)
   goals met: 9 of 13
30. (board-truck driver4 truck2 s2)
   deleted: (at driver4 s2) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 9 of 13
31. (drive-truck truck2 s2 s1 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 459 to 490
   goals met: 10 of 13
32. (drive-truck truck2 s1 s4 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 490 to 551
   goals met: 9 of 13
33. (disembark-truck driver4 truck2 s4)
   deleted: (driving driver4 truck2)
   added: (at driver4 s4) (empty truck2)
   goals met: 10 of 13
34. (board-truck driver1 truck4 s3)
   deleted: (at driver1 s3) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 9 of 13
35. (drive-truck truck4 s3 s2 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   changed: (driven) from 551 to 560
   goals met: 9 of 13
36. (disembark-truck driver1 truck4 s2)
   deleted: (driving driver1 truck4)
   added: (at driver1 s2) (empty truck4)
   goals met: 9 of 13
37. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 9 of 13
38. (drive-truck truck1 s2 s5 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (driven) from 560 to 561
   goals met: 10 of 13
39. (disembark-truck driver1 truck1 s5)
   deleted: (driving driver1 truck1)
   added: (at driver1 s5) (empty truck1)
   goals met: 10 of 13
40. (board-truck driver4 truck2 s4)
   deleted: (at driver4 s4) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 9 of 13
41. (walk driver1 s5 p3-5)
   deleted: (at driver1 s5)
   added: (at driver1 p3-5)
   changed: (walked) from 0 to 73
   goals met: 9 of 13
42. (walk driver1 p3-5 s3)
   deleted: (at driver1 p3-5)
   added: (at driver1 s3)
   changed: (walked) from 73 to 137
   goals met: 10 of 13
43. (drive-truck truck2 s4 s0 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (driven) from 561 to 596
   goals met: 10 of 13
44. (disembark-truck driver4 truck2 s0)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 10 of 13
45. (walk driver4 s0 p0-4)
   deleted: (at driver4 s0)
   added: (at driver4 p0-4)
   changed: (walked) from 137 to 220
   goals met: 10 of 13
46. (walk driver4 p0-4 s4)
   deleted: (at driver4 p0-4)
   added: (at driver4 s4)
   changed: (walked) from 220 to 239
   goals met: 11 of 13
47. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 10 of 13
48. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 10 of 13
49. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 596 to 600
   goals met: 11 of 13
50. (drive-truck truck2 s1 s2 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (driven) from 600 to 631
   goals met: 10 of 13
51. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 10 of 13
52. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 10 of 13
53. (drive-truck truck4 s2 s1 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (driven) from 631 to 662
   goals met: 11 of 13
54. (drive-truck truck3 s3 s2 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (driven) from 662 to 671
   goals met: 10 of 13
55. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 10 of 13
56. (disembark-truck driver3 truck4 s1)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 10 of 13
57. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 10 of 13
58. (drive-truck truck3 s2 s3 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (driven) from 671 to 680
   goals met: 11 of 13
59. (disembark-truck driver1 truck3 s3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 12 of 13
60. (walk driver3 s1 p1-2)
   deleted: (at driver3 s1)
   added: (at driver3 p1-2)
   changed: (walked) from 239 to 306
   goals met: 12 of 13
61. (walk driver3 p1-2 s2)
   deleted: (at driver3 p1-2)
   added: (at driver3 s2)
   changed: (walked) from 306 to 313
   goals met: 12 of 13
62. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 12 of 13
63. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 680 to 711
   goals met: 13 of 13
